app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (status = 'available')
---
  def index
    @products = Product.where(["status = ?", "available"])

INSERT INTO "products" ("name", "amount", "seller", "created_at", "updated_at", "seller_id", "status") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Black Mamba"], ["amount", 30], ["seller", "Mick Johnson"], ["created_at", 2017-03-29 20:18:08 UTC], ["updated_at", 2017-03-29 20:18:08 UTC], ["seller_id", 2], ["status", "available"]]
---
  def create
    @user = current_user
    @product = Product.new(product_params)
    if @product.valid?
      @product.seller = current_user.first_name + current_user.last_name
      @product.seller_id = @user.id
      @product.status = "available"
      @product.save

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "products" SET "status" = ?, "buyer" = ?, "buyer_id" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["status", "sold"], ["buyer", "Mick Johnson"], ["buyer_id", 2], ["updated_at", 2017-03-29 20:45:40 UTC], ["id", 11]]
---
  def update
    @user = current_user
    @product = Product.find(params[:product_id])
    @product.status = "sold"
    @product.buyer = current_user.first_name + current_user.last_name
    @product.buyer_id = @user.id
    @product.save