app/controllers/users_controller.rb

  def show
    @user = current_user
    @product = Product.where("seller_id =?" , @user.id)
---
SELECT  "products".* FROM "products" WHERE (seller_id =2) AND "products"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT SUM($amount) FROM "products" WHERE (buyer_id =2)